## OpenTofu Plan: platform/management/backup

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # azurerm_data_protection_backup_vault.platform_compliance_sea_01 will be created
  + resource "azurerm_data_protection_backup_vault" "platform_compliance_sea_01" {
      + cross_region_restore_enabled = false
      + datastore_type               = "VaultStore"
      + id                           = (known after apply)
      + immutability                 = "Unlocked"
      + location                     = "southeastasia"
      + name                         = "bvault-platform-compliance-sea-01"
      + redundancy                   = "GeoRedundant"
      + resource_group_name          = "rg-platform-backup-sea"
      + retention_duration_in_days   = 14
      + soft_delete                  = "AlwaysOn"
      + tags                         = {
          + "costcenter" = "cc-it-platform"
          + "env"        = "shared"
          + "iac_tool"   = "opentofu"
          + "managed_by" = "iac"
          + "org"        = "kneadcode"
          + "owner"      = "platform-engineering"
          + "portfolio"  = "coruscant"
          + "purpose"    = "platform-backup-paas-compliance"
          + "workload"   = "platform-backup"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_recovery_services_vault.platform_sea_01 must be replaced
-/+ resource "azurerm_recovery_services_vault" "platform_sea_01" {
      - classic_vmware_replication_enabled = false -> null
      ~ cross_region_restore_enabled       = true -> false # forces replacement
      ~ id                                 = "/subscriptions/a998a203-5e24-4c8d-b2d2-536f14f7bf87/resourceGroups/rg-platform-backup-sea/providers/Microsoft.RecoveryServices/vaults/rsv-platform-sea-01" -> (known after apply)
        name                               = "rsv-platform-sea-01"
        tags                               = {
            "costcenter" = "cc-it-platform"
            "env"        = "shared"
            "iac_tool"   = "opentofu"
            "managed_by" = "iac"
            "org"        = "kneadcode"
            "owner"      = "platform-engineering"
            "portfolio"  = "coruscant"
            "purpose"    = "platform-backup-iaas"
            "workload"   = "platform-backup"
        }
        # (7 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "379bcfed-d60b-41e1-8bb5-ffa16f9ebf41" -> (known after apply)
          ~ tenant_id    = "7ba436b3-340f-4c81-8cd6-2600302173a4" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
